podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA0_8CH_EARS_MKE15Z7.svd.xml
<!--
Devices using this peripheral:
      MKE14Z7
      MKE15Z7
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "DMA0_8CH_EARS_MKE15Z7" ?>
         <?preferredAccessWidth "32" ?>
         <name>DMA0</name>
         <description>Enhanced direct memory access controller</description>
         <groupName>DMA0</groupName>
         <headerStructName>DMA</headerStructName>
         <baseAddress>0x40008000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x14</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x18</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x24</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x2C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x34</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x44</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1000</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>EDBG</name>
                     <description>Enable Debug\n
Disables DMA operation in Debug mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>DMA continues</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA stalls</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERCA</name>
                     <description>Enable Round Robin Channel Arbitration\n
Control arbitration for channel selection within each group</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Fixed Priority</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Round Robin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOE</name>
                     <description>Halt On Error\n
Allow all operations to suspend on any error (HALT Is set)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Any error sets HALT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HALT</name>
                     <description>Halt DMA Operations\n
Halt DMA at the end of current channel operations</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Stall new channels</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLM</name>
                     <description>Continuous Link Mode\n
Controls whether a minor loop channel link made to itself goes through channel arbitration before being activated again</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel re-arbitrates</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Continues without re-arbitration</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMLM</name>
                     <description>Enable Minor Loop Mapping\n
Activates Minor Loop Mapping\n
TCDn.word2 is interpreted to include individual enable fields, an offset field, and the NBYTES field.\n
The individual enable fields allow the minor loop offset to be applied to the source address, the destination address, or both.\n
The NBYTES field is reduced when either offset is enabled</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled\tTCDn.word2 is defined as a 32-bit NBYTES field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled\tTCDn.word2 includes individual enable fields, offset and NBYTES field</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECX</name>
                     <description>Cancel Data Transfer and set Error\n
Stop the executing channel and force the minor loop to finish.\n
The cancel takes effect after the last write of the current read/write sequence.\n
The CX bit clears itself after the cancel has been honoured.\n
This cancel retires the channel normally as if the minor loop was completed.\n
The ES register is updated and may generate an optional error interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cancel transfer with error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CX</name>
                     <description>Cancel Remaining Data Transfer\n
Stop the executing channel and force the minor loop to finish.\n
The cancel takes effect after the last write of the current read/write sequence.\n
The CX bit clears itself after the cancel has been honoured.\n
This cancel retires the channel normally as if the minor loop was completed</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cancel remainder of transfer</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>DMA Active Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>eDMA is idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>eDMA is executing a channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ES</name>
               <description>Error Status Register\n
The ES provides information concerning the last recorded channel error</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DBE</name>
                     <description>Destination Bus Error\n
Indicates that there was a bus error on a destination write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DBE" > <name>SBE</name> <description>Source Bus Error\n
Indicates that there was a bus error on a source read</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>SGE</name> <description>Scatter/Gather Configuration Error\n
Indicates that there was a configuration error detected in the TCDn_DLASTSGA field</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>NCE</name> <description>NBYTES/CITER Configuration Error\n
Indicates that there was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>DOE</name> <description>Destination Offset Error\n
Indicates that there was a configuration error detected in the TCDn_DOFF field</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>DAE</name> <description>Destination Address Error\n
Indicates that there was a configuration error detected in the TCDn_DADDR field</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>SOE</name> <description>Source Offset Error\n
Indicates that there was a configuration error detected in the TCDn_SOFF field</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="DBE" > <name>SAE</name> <description>Source Address Error\n
Indicates that there was a configuration error detected in the TCDn_SADDR field</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>ERRCHN</name>
                     <description>Error or Cancelled Channel Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel number</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DBE" > <name>CPE</name> <description>Channel Priority Error\n
Indicates that there was a configuration error in the channel priorities.
Channel priorities are not unique (within a group)</description> <bitOffset>14</bitOffset> </field>
                  <field>
                     <name>ECX</name>
                     <description>Transfer Cancelled\n
Indicates that a transfer was cancelled by the error cancel transfer input</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No cancelled transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cancelled transfer</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VLD</name>
                     <description>Logical OR of all Error status bits\n
Indicates that at least one ERR bit is set indicating a valid error exists that has not been cleared</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No bits are set</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error bits set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERQ</name>
               <description>Enable Request Register\n
Contains a bit to enable or disable requests from each channel</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ERQ0</name>
                     <description>Enable DMA Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Requests disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Requests enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERQ0" > <name>ERQ1</name> <description>Enable DMA Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ2</name> <description>Enable DMA Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ3</name> <description>Enable DMA Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ4</name> <description>Enable DMA Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ5</name> <description>Enable DMA Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ6</name> <description>Enable DMA Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ7</name> <description>Enable DMA Request 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>EEI</name>
               <description>Enable Error Interrupt Register\n
Contains a bit to enable or disable errors interrupts from each channel</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>EEI0</name>
                     <description>Enable Error Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EEI0" > <name>EEI1</name> <description>Enable Error Interrupt 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI2</name> <description>Enable Error Interrupt 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI3</name> <description>Enable Error Interrupt 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI4</name> <description>Enable Error Interrupt 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI5</name> <description>Enable Error Interrupt 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI6</name> <description>Enable Error Interrupt 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI7</name> <description>Enable Error Interrupt 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CEEI</name>
               <description>Clear Enable Error Interrupt Register\n
Provides a simple memory-mapped mechanism to clear a given bit in the EEI to disable the error interrupt for a given channel.\n
The data value on a register write causes the corresponding bit in the EEI to be cleared</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CEEI</name>
                     <description>Clear Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to clear</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAEE</name>
                     <description>Clear All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
