podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA0_8CH_EARS_MKE15Z7.svd.xml
            <register>
               <name>SEEI</name>
               <description>Set Enable Error Interrupt Register\n
Provides a simple memory-mapped mechanism to set a given bit in the EEI to enable the error interrupt for a given channel.\n
The data value on a register write causes the corresponding bit in the EEI to be set</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SEEI</name>
                     <description>Set Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to set</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAEE</name>
                     <description>Set All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to set all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CERQ</name>
               <description>Clear Enable Request Register\n
Provides a simple memory-mapped mechanism to clear a given bit in the ERQ to disable the DMA request from a given channel.\n
The data value on a register write causes the corresponding bit in the ERQ to be cleared</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CERQ</name>
                     <description>Clear Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to clear</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAER</name>
                     <description>Clear All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SERQ</name>
               <description>Set Enable Request Register\n
Clear Enable Request Register\n
Provides a simple memory-mapped mechanism to set a given bit in the ERQ to enable the DMA request from a given channel.\n
The data value on a register write causes the corresponding bit in the ERQ to be set</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SERQ</name>
                     <description>Set Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to set</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAER</name>
                     <description>Set All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to set all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDNE</name>
               <description>Clear DONE Status Bit Register\n
Provides a simple memory-mapped mechanism to clear the DONE bit in the TCD of the given channel</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CDNE</name>
                     <description>Clear DONE Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to clear</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CADN</name>
                     <description>Clears All DONE Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSRT</name>
               <description>Set START Bit Register\n
Provides a simple memory-mapped mechanism to set the START bit in the TCD of the given channel</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SSRT</name>
                     <description>Set START Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to start</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAST</name>
                     <description>Set All START Bits (activates all channels)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to start all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CERR</name>
               <description>Clear Error Register</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CERR</name>
                     <description>Clear Error Indicator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to clear</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAEI</name>
                     <description>Clear All Error Indicators</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CINT</name>
               <description>Clear Interrupt Request Register</description>
               <addressOffset>0x1F</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CINT</name>
                     <description>Clear Interrupt Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>Channel to clear</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAIR</name>
                     <description>Clear All Interrupt Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear all</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Operation enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 for NOP</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT</name>
               <description>Interrupt Request Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>INT0</name>
                     <description>Interrupt Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Request pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="INT0" > <name>INT1</name> <description>Interrupt Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT2</name> <description>Interrupt Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT3</name> <description>Interrupt Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT4</name> <description>Interrupt Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT5</name> <description>Interrupt Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT6</name> <description>Interrupt Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT7</name> <description>Interrupt Request 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ERR</name>
               <description>Error Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>ERR0</name>
                     <description>Error In Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERR0" > <name>ERR1</name> <description>Error In Channel 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR2</name> <description>Error In Channel 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR3</name> <description>Error In Channel 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR4</name> <description>Error In Channel 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR5</name> <description>Error In Channel 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR6</name> <description>Error In Channel 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR7</name> <description>Error In Channel 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>HRS</name>
               <description>Hardware Request Status Register</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>HRS0</name>
                     <description>Hardware Request Status Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Request present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="HRS0" > <name>HRS1</name> <description>Hardware Request Status Channel 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS2</name> <description>Hardware Request Status Channel 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS3</name> <description>Hardware Request Status Channel 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS4</name> <description>Hardware Request Status Channel 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS5</name> <description>Hardware Request Status Channel 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS6</name> <description>Hardware Request Status Channel 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="HRS0" > <name>HRS7</name> <description>Hardware Request Status Channel 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
