podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA0_8CH_EARS_MKE15Z7.svd.xml
            <register derivedFrom="DCHPRI%s"><dim>8</dim><dimIndex>0,1,2,3,4,5,6,7</dimIndex> <name>DCHPRIn%s</name> <addressOffset>0x100</addressOffset> <resetMask>0xFF</resetMask> </register>
            <register>
               <name>TCD_RAW</name>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0-63</dimIndex>
               <size>32</size>
               <description>Raw TCD array as uint32_t</description>
               <addressOffset>0x1000</addressOffset>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>32</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>TCD,@p@a@i_@f</name>
               <addressOffset>0x1000</addressOffset>
               <register>
                  <name>SADDR</name>
                  <description>Source Address</description>
                  <addressOffset>0x0</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SADDR</name>
                        <description>Source Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SOFF</name>
                  <description>Signed Source Address Offset</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SOFF</name>
                        <description>Source Address Signed Offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ATTR</name>
                  <description>Transfer Attributes</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DSIZE</name>
                        <description>Destination Data Transfer Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b000</name>
                              <description>8-bit</description>
                              <value>0b000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b001</name>
                              <description>16-bit</description>
                              <value>0b001</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b010</name>
                              <description>32-bit</description>
                              <value>0b010</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b011</name>
                              <description>Reserved</description>
                              <value>0b011</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b100</name>
                              <description>16-byte</description>
                              <value>0b100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b101</name>
                              <description>32-byte</description>
                              <value>0b101</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b110</name>
                              <description>Reserved</description>
                              <value>0b110</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b111</name>
                              <description>Reserved</description>
                              <value>0b111</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DMOD</name>
                        <description>Destination Address Modulo</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00000</name>
                              <description>Modulo not used</description>
                              <value>0b00000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0bXXXXX</name>
                              <description>Modulo value</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field derivedFrom="DSIZE" > <name>SSIZE</name> <description>Source data transfer size</description> <bitOffset>8</bitOffset> </field>
                     <field derivedFrom="DMOD" > <name>SMOD</name> <description>Source Address Modulo</description> <bitOffset>11</bitOffset> </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLNO</name>
                  <description>Minor Byte Count (Minor Loop Disabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Transfer Count</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLOFFNO</name>
                  <description>Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Transfer Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>30</bitWidth>
                     </field>
                     <field>
                        <name>DMLOE</name>
                        <description>Destination Minor Loop Offset enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No offset</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Offset applied to DADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMLOE</name>
                        <description>Source Minor Loop Offset Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No offset</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Offset applied to SADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLOFFYES</name>
                  <description>Signed Minor Loop Offset (Minor Loop and Offset Enabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Transfer Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>MLOFF</name>
                        <description>Address offset\n
If SMLOE or DMLOE is set, this field represents a sign-extended offset applied to the source or destination address to form the next-state value after the minor loop completes</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>20</bitWidth>
                     </field>
                     <field>
                        <name>DMLOE</name>
                        <description>Destination Minor Loop Offset enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No offset</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Offset applied to DADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMLOE</name>
                        <description>Source Minor Loop Offset Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No offset</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Offset applied to SADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SLAST</name>
                  <description>Last Source Address Adjustment</description>
                  <addressOffset>0xC</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SLAST</name>
                        <description>Last source Address Adjustment</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADDR</name>
                  <description>Destination Address</description>
                  <addressOffset>0x10</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DADDR</name>
                        <description>Destination Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DOFF</name>
                  <description>Signed Destination Address Offset</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DOFF</name>
                        <description>Destination Address Signed offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CITER_ELINKNO</name>
                  <description>Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>CITER</name>
                        <description>Current Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enable channel-to-channel linking on minor-loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Linking disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Linking enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CITER_ELINKYES</name>
                  <description>Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>CITER</name>
                        <description>Current Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>LINKCH</name>
                        <description>Link Channel Number</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bXXX</name>
                              <description>Channel #</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enable channel-to-channel linking on minor-loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Linking disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Linking enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DLASTSGA</name>
                  <description>Last Destination Address Adjustment/Scatter Gather Address\n
This is either the:\n
\t- Destination last address adjustment or
\t- Memory address for the next transfer control descriptor to be loaded into this channel (scatter/gather)</description>
                  <addressOffset>0x18</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DLASTSGA</name>
                        <description>Destination last address adjustment</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
