podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA0_8CH_EARS_MKE15Z7.svd.xml
               <register>
                  <name>CSR</name>
                  <description>Control and Status</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>START</name>
                        <description>Channel Start\n
If this flag is set, the channel is requesting service.\n
The flag automatically clears after the channel begins execution</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Not explicitly started</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Started via software request</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INTMAJOR</name>
                        <description>Enable an interrupt when major iteration count completes</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Interrupt disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Interrupt enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field derivedFrom="INTMAJOR" > <name>INTHALF</name> <description>Enable an interrupt when major counter is half complete</description> <bitOffset>2</bitOffset> </field>
                     <field>
                        <name>DREQ</name>
                        <description>Disable Request\n
Controls if the ERQ bit is cleared when the major loop is complete</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>ERQ bit unaffected</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>ERQ bit cleared</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ESG</name>
                        <description>Enable Scatter/Gather Processing\n
If enabled the current channel&apos;s TCD specifies a scatter gather format.\n
The DLASTSGA field provides a memory pointer to the next TCD to be loaded into this channel after the major loop completes its execution</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MAJORELINK</name>
                        <description>Enable channel-to-channel linking on major loop complete</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ACTIVE</name>
                        <description>Channel Active\n
This flag signals the channel is currently in execution.\n
It sets when service begins and clears when the minor loop completes or on any error</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Idle</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Busy</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DONE</name>
                        <description>Channel Done\n
This flag indicates the eDMA has completed the major loop.\n
The eDMA engine sets it as the CITER count reaches zero.\n
The software or hardware clears it when the channel is activated</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Not completed</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Completed</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MAJORLINKCH</name>
                        <description>Link Channel Number</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bXXX</name>
                              <description>Channel #</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BWC</name>
                        <description>Bandwidth Control\n
Allows the eDMA to be briefly stalled after each read/write</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>No stalls</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b01</name>
                              <description>Reserved</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b10</name>
                              <description>4 cycle stall</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b11</name>
                              <description>8 cycle stall</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BITER_ELINKNO</name>
                  <description>Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>BITER</name>
                        <description>Starting Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enables channel-to-channel linking on minor loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BITER_ELINKYES</name>
                  <description>Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>BITER</name>
                        <description>Starting Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>LINKCH</name>
                        <description>Link Channel Number</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bXXX</name>
                              <description>Channel #</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enables channel-to-channel linking on minor loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
